# SpecTypeId.Boolean Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SpecTypeId..::..Boolean Properties
SpecTypeId..::..Boolean Class See Also
---
The SpecTypeId..::..Boolean type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| YesNo | Yes/No, in discipline Common. |

# See Also
SpecTypeId..::..Boolean Class
Autodesk.Revit.DB Namespace